Tekla Open API Reference for Tekla Structures 2025
Drawing.IsMasterDrawing Property
 Describes whether the drawing is a master drawing (shown with a special symbol on the drawing list).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsMasterDrawing { get; set; }
Public Property IsMasterDrawing As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Drawing Class
Tekla.Structures.Drawing Namespace